sim/single-trait-simulation.org
#+title: Generate LD matrix and do single trait whole-genome simulation
#+subtitle:
#+description:
#+date: 2021-03-01
#+author: Liu, Shouye
#+STARTUP: overview

* Per LD block LD matrix
** Extract snplist from per ld block and generate HM3 data based on snpInfo
#+begin_src R
library(data.table)
mainPath = "/home/uqsliu28/90days/projects/sbayesRC/ldAndMa/ldblock/"
ldbinfoFileSuffix = "chr-1-22-ukbV3_eur_unrel_n20k_hm3.eigen.ldblock.info"
snpinfoFileSuffix = "chr-1-22-ukbV3_eur_unrel_n20k_hm3.eigen.ldblock.snp.info"
ldbinfo = fread( paste0(mainPath,ldbinfoFileSuffix))
snpinfo = fread( paste0(mainPath,snpinfoFileSuffix))
lbs = unique(ldbinfo$ldBlockID)
for(i in lbs){
  snps = ldbinfo[which(ldbinfo$ldBlockID == i),]
  snpNumInLbs = unique(snps$NumSnpInLdBlock)
  snplist = snps$snpInLdBlock
  outFile = paste0(mainPath,"/snplist/","ukbV3_eur_unrel_n20k_hm3-ldm-block-",i,"")
  fwrite(data.frame(snplist),file = outFile,col.names = FALSE)
}

outFile = paste0(mainPath,"/snplist/","ukbV3_eur_unrel_n20k_hm3.snplists")
fwrite(data.frame(snpinfo$ID),file = outFile,col.names = FALSE)

## ## Use plink to extract HM3
## plink19 = "/home/uqsliu28/softwares/plink/plink19"
## rawDatPath <- "//home/uqsliu28/projects/annotation//dataRaw/ukbGeno/"
## bfileName <- paste0(paste0(rawDatPath,"ukbEURu_imp_v3_HM3_maf01" ) )
## bim = fread(paste0(bfileName,".bim"))

## ## plinkHM3 <- paste0(plink19," --bfile ",rawDataPath,rawBimFileSuffix,
## ##                     "--extract ", snpListFile,
## ##                     " --make-bed ",
## ##                     " --out ", outPath, rawBimFileSuffix, ".assoc"
## ##                     )

## ## ## run gwas function
## ## system(plinkHM3)
#+end_src
** Generate LD matrix based on per-block-snplist
#+begin_src bash
gctb="/home/uqsliu28/softwares/sbayese/gctb-genesvd0215"

rawDatPath="/home/uqsliu28/90days/projects/annotation/real/debug/data/"
outPath="/home/uqsliu28/90days/projects/sbayesRC/ldAndMa/ldblock"
snpinfo="ukbV3_eur_unrel_n20k_hm3-ldm-block-${TASK_ID}"

bfileSuffix="ukbV3_eur_unrel_n20k_hm3"
outFile="ukbV3_eur_unrel_n20k_hm3-ldm-block-${TASK_ID}.txt"

${gctb} --bfile ${rawDatPath}/${bfileSuffix} \
    --make-full-ldm \
    --write-ldm-txt \
    --extract ${outPath}/snplist/${snpinfo} \
    --out   ${outPath}/ldm/${outFile} 2>&1 | tee ${outPath}/log/log-${outFile}.log
################################################################
######################### Script ends ##########################
################################################################
## Step 1. Basic cluster setting
## homePath="/home/yangjianLab/liushouye/"
homePath="/home/uqsliu28/"
qsubshcom="${homePath}/softwares/qsubshcom/qsubshcom"
## scriptPath="${homePath}/projects/annotation/sim/prediction/eqtlComparison/scripts"
scriptPath="/home/uqsliu28/90days/projects/sbayesRC/ldAndMa/ldblock"
logPath="${scriptPath}/log"
mkdir -p ${logPath}

scriptName="ldm.sh"
chmod 751 ${scriptPath}/${scriptName}
qsubName="${scriptName}"
printLog="${logPath}/${qsubName}-$(date +"%Y-%m-%d-%I-%M-%p").log"
tmp_cmd="${scriptPath}/${scriptName}  > ${printLog}"
## $qsubshcom "$tmp_cmd" 1 60G  ${qsubName}  100:00:00 "-queue=intel-fat,amd-ep2"
$qsubshcom "$tmp_cmd" 1 100G  ${qsubName}  100:00:00 "-queue=normal -array=1-591"
#+end_src

* Simulation
** Testing dataset
