sim/single-trait-simulation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-01 Wed 15:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Generate LD matrix and do single trait whole-genome simulation</title>
<meta name="author" content="Liu, Shouye" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Generate LD matrix and do single trait whole-genome simulation</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgce0f9c8">1. Per LD block LD matrix</a>
<ul>
<li><a href="#org325144e">1.1. Extract snplist from per ld block and generate HM3 data based on snpInfo</a></li>
<li><a href="#org31fbacf">1.2. Generate LD matrix based on per-block-snplist</a></li>
</ul>
</li>
<li><a href="#org2cea990">2. Simulation</a>
<ul>
<li><a href="#org4254376">2.1. Testing dataset</a>
<ul>
<li><a href="#org5ea9bcd">2.1.1. Select samples</a></li>
<li><a href="#orgaaf44e6">2.1.2. Selecting a series of training datasets</a></li>
</ul>
</li>
<li><a href="#orge104089">2.2. Generating simulation</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgce0f9c8" class="outline-2">
<h2 id="orgce0f9c8"><span class="section-number-2">1.</span> Per LD block LD matrix</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org325144e" class="outline-3">
<h3 id="org325144e"><span class="section-number-3">1.1.</span> Extract snplist from per ld block and generate HM3 data based on snpInfo</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #a9a1e1;">library</span>(data.table)
mainPath = <span style="color: #98be65;">"/home/uqsliu28/90days/projects/sbayesRC/ldAndMa/ldblock/"</span>
ldbinfoFileSuffix = <span style="color: #98be65;">"chr-1-22-ukbV3_eur_unrel_n20k_hm3.eigen.ldblock.info"</span>
snpinfoFileSuffix = <span style="color: #98be65;">"chr-1-22-ukbV3_eur_unrel_n20k_hm3.eigen.ldblock.snp.info"</span>
ldbinfo = fread( paste0(mainPath,ldbinfoFileSuffix))
snpinfo = fread( paste0(mainPath,snpinfoFileSuffix))
lbs = unique(ldbinfo$ldBlockID)
<span style="color: #51afef;">for</span>(i <span style="color: #51afef;">in</span> lbs){
  snps = ldbinfo[which(ldbinfo$ldBlockID == i),]
  snpNumInLbs = unique(snps$NumSnpInLdBlock)
  snplist = snps$snpInLdBlock
  outFile = paste0(mainPath,<span style="color: #98be65;">"/snplist/"</span>,<span style="color: #98be65;">"ukbV3_eur_unrel_n20k_hm3-ldm-block-"</span>,i,<span style="color: #98be65;">""</span>)
  fwrite(data.frame(snplist),file = outFile,col.names = <span style="color: #ECBE7B;">FALSE</span>)
}

outFile = paste0(mainPath,<span style="color: #98be65;">"/snplist/"</span>,<span style="color: #98be65;">"ukbV3_eur_unrel_n20k_hm3.snplists"</span>)
fwrite(data.frame(snpinfo$ID),file = outFile,col.names = <span style="color: #ECBE7B;">FALSE</span>)

<span style="color: #5B6268;">## </span><span style="color: #5B6268;">## Use plink to extract HM3</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">plink19 = "/home/uqsliu28/softwares/plink/plink19"</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">rawDatPath &lt;- "//home/uqsliu28/projects/annotation//dataRaw/ukbGeno/"</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">bfileName &lt;- paste0(paste0(rawDatPath,"ukbEURu_imp_v3_HM3_maf01" ) )</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">bim = fread(paste0(bfileName,".bim"))</span>

<span style="color: #5B6268;">## </span><span style="color: #5B6268;">## plinkHM3 &lt;- paste0(plink19," --bfile ",rawDataPath,rawBimFileSuffix,</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">##                     "--extract ", snpListFile,</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">##                     " --make-bed ",</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">##                     " --out ", outPath, rawBimFileSuffix, ".assoc"</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">##                     )</span>

<span style="color: #5B6268;">## </span><span style="color: #5B6268;">## ## run gwas function</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">## system(plinkHM3)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org31fbacf" class="outline-3">
<h3 id="org31fbacf"><span class="section-number-3">1.2.</span> Generate LD matrix based on per-block-snplist</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #dcaeea;">gctb</span>=<span style="color: #98be65;">"/home/uqsliu28/softwares/sbayese/gctb-genesvd0215"</span>

<span style="color: #dcaeea;">rawDatPath</span>=<span style="color: #98be65;">"/home/uqsliu28/90days/projects/annotation/real/debug/data/"</span>
<span style="color: #dcaeea;">outPath</span>=<span style="color: #98be65;">"/home/uqsliu28/90days/projects/sbayesRC/ldAndMa/ldblock"</span>
<span style="color: #dcaeea;">snpinfo</span>=<span style="color: #98be65;">"ukbV3_eur_unrel_n20k_hm3-ldm-block-</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">{TASK_ID}</span><span style="color: #98be65;">"</span>

<span style="color: #dcaeea;">bfileSuffix</span>=<span style="color: #98be65;">"ukbV3_eur_unrel_n20k_hm3"</span>
<span style="color: #dcaeea;">outFile</span>=<span style="color: #98be65;">"ukbV3_eur_unrel_n20k_hm3-ldm-block-</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">{TASK_ID}</span><span style="color: #98be65;">.txt"</span>

$<span style="color: #51afef;">{</span><span style="color: #dcaeea;">gctb</span><span style="color: #51afef;">}</span> --bfile $<span style="color: #51afef;">{</span><span style="color: #dcaeea;">rawDatPath</span><span style="color: #51afef;">}</span>/$<span style="color: #51afef;">{</span><span style="color: #dcaeea;">bfileSuffix</span><span style="color: #51afef;">}</span> <span style="color: #98be65;">\</span>
    --make-full-ldm <span style="color: #98be65;">\</span>
    --write-ldm-txt <span style="color: #98be65;">\</span>
    --extract $<span style="color: #51afef;">{</span><span style="color: #dcaeea;">outPath</span><span style="color: #51afef;">}</span>/snplist/$<span style="color: #51afef;">{</span><span style="color: #dcaeea;">snpinfo</span><span style="color: #51afef;">}</span> <span style="color: #98be65;">\</span>
    --out   $<span style="color: #51afef;">{</span><span style="color: #dcaeea;">outPath</span><span style="color: #51afef;">}</span>/ldm/$<span style="color: #51afef;">{</span><span style="color: #dcaeea;">outFile</span><span style="color: #51afef;">}</span> <span style="color: #da8548; font-weight: bold;">2</span>&gt;&amp;<span style="color: #da8548; font-weight: bold;">1</span> | tee $<span style="color: #51afef;">{</span><span style="color: #dcaeea;">outPath</span><span style="color: #51afef;">}</span>/log/log-$<span style="color: #51afef;">{</span><span style="color: #dcaeea;">outFile</span><span style="color: #51afef;">}</span>.log
<span style="color: #5B6268;">################################################################</span>
<span style="color: #5B6268;">######################### </span><span style="color: #5B6268;">Script ends ##########################</span>
<span style="color: #5B6268;">################################################################</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">Step 1. Basic cluster setting</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">homePath="/home/yangjianLab/liushouye/"</span>
<span style="color: #dcaeea;">homePath</span>=<span style="color: #98be65;">"/home/uqsliu28/"</span>
<span style="color: #dcaeea;">qsubshcom</span>=<span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">{homePath}</span><span style="color: #98be65;">/softwares/qsubshcom/qsubshcom"</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">scriptPath="${homePath}/projects/annotation/sim/prediction/eqtlComparison/scripts"</span>
<span style="color: #dcaeea;">scriptPath</span>=<span style="color: #98be65;">"/home/uqsliu28/90days/projects/sbayesRC/ldAndMa/ldblock"</span>
<span style="color: #dcaeea;">logPath</span>=<span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">{scriptPath}</span><span style="color: #98be65;">/log"</span>
<span style="color: #ECBE7B;">mkdir</span> -p $<span style="color: #51afef;">{</span><span style="color: #dcaeea;">logPath</span><span style="color: #51afef;">}</span>

<span style="color: #dcaeea;">scriptName</span>=<span style="color: #98be65;">"ldm.sh"</span>
<span style="color: #ECBE7B;">chmod</span> <span style="color: #da8548; font-weight: bold;">751</span> $<span style="color: #51afef;">{</span><span style="color: #dcaeea;">scriptPath</span><span style="color: #51afef;">}</span>/$<span style="color: #51afef;">{</span><span style="color: #dcaeea;">scriptName</span><span style="color: #51afef;">}</span>
<span style="color: #dcaeea;">qsubName</span>=<span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">{scriptName}</span><span style="color: #98be65;">"</span>
<span style="color: #dcaeea;">printLog</span>=<span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">{logPath}</span><span style="color: #98be65;">/</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">{qsubName}</span><span style="color: #98be65;">-</span><span style="color: #51afef; font-weight: bold;">$(</span><span style="color: #51afef; font-weight: bold;">date</span><span style="color: #51afef; font-weight: bold;"> +"%Y-%m-%d-%I-%M-%p")</span><span style="color: #98be65;">.log"</span>
<span style="color: #dcaeea;">tmp_cmd</span>=<span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">{scriptPath}</span><span style="color: #98be65;">/</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">{scriptName}</span><span style="color: #98be65;">  &gt; </span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">{printLog}</span><span style="color: #98be65;">"</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">$qsubshcom "$tmp_cmd" 1 60G  ${qsubName}  100:00:00 "-queue=intel-fat,amd-ep2"</span>
$<span style="color: #dcaeea;">qsubshcom</span> <span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">tmp_cmd</span><span style="color: #98be65;">"</span> <span style="color: #da8548; font-weight: bold;">1</span> 100G  $<span style="color: #51afef;">{</span><span style="color: #dcaeea;">qsubName</span><span style="color: #51afef;">}</span>  100:00:00 <span style="color: #98be65;">"-queue=normal -array=1-591"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2cea990" class="outline-2">
<h2 id="org2cea990"><span class="section-number-2">2.</span> Simulation</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org4254376" class="outline-3">
<h3 id="org4254376"><span class="section-number-3">2.1.</span> Testing dataset</h3>
<div class="outline-text-3" id="text-2-1">
</div>
