sim/single-trait-simulation.org
*** Select samples
#+begin_src bash
options(scipen=999)
library(data.table)
set.seed(1234)
MainPath <- "/home/yangjianLab/liushouye/projects/annotation/"
MainPath <- "/home/uqsliu28/projects/annotation/"

rawDataPath <- paste0(MainPath, "/dataRaw/ukbGeno/")
outPath <- paste0("/scratch/90days/uqsliu28/projects/sbayesRC/ldAndMa/sim/data/")
commandline <- paste0("mkdir -p ",outPath)
system(commandline)

rawFamFileSuffix <- paste0("ukbEURu_imp_v3_HM3_maf01" )
rawFamFile <- paste0(rawDataPath,rawFamFileSuffix,".fam")
fam <- fread(rawFamFile)
names(fam) <- c("FID","IID","FA","MA","SEX","PHENO")

sams <- c(300000,dim(fam)[1] - 300000)
tags <- c("train","valid")
samsLeft <- fam[,c("FID","IID")]
for(i in 1:length(sams)){
    tmp <- samsLeft[sample(.N,sams[i])]
    ## remove inds sampled
    samsLeft <- samsLeft[!samsLeft$FID %in% tmp$FID,]
    ## training dataset
    tmpFileName <- paste0(tags[i],"-chr1-22-shuf-",sams[i],
                          "-sams-ukbEURu_imp_v3_HM3_maf01-",Sys.Date(),".samlist")
    tmpFilePath <- paste0(outPath,tmpFileName)
    fwrite(data.frame(tmp),file=tmpFilePath,col.names = FALSE, sep = "\t")
}

#+end_src
