sim/single-trait-simulation.html
<div id="outline-container-org5ea9bcd" class="outline-4">
<h4 id="org5ea9bcd"><span class="section-number-4">2.1.1.</span> Select samples</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #c678dd;">options</span><span style="color: #51afef;">(</span><span style="color: #dcaeea;">scipen</span>=<span style="color: #da8548; font-weight: bold;">999</span><span style="color: #51afef;">)</span>
<span style="color: #c678dd;">library</span><span style="color: #51afef;">(</span>data.table<span style="color: #51afef;">)</span>
<span style="color: #c678dd;">set.seed</span><span style="color: #51afef;">(</span><span style="color: #da8548; font-weight: bold;">1234</span><span style="color: #51afef;">)</span>
MainPath &lt;- <span style="color: #98be65;">"/home/yangjianLab/liushouye/projects/annotation/"</span>
MainPath &lt;- <span style="color: #98be65;">"/home/uqsliu28/projects/annotation/"</span>

rawDataPath &lt;- paste0<span style="color: #51afef;">(</span>MainPath, <span style="color: #98be65;">"/dataRaw/ukbGeno/"</span><span style="color: #51afef;">)</span>
outPath &lt;- paste0<span style="color: #51afef;">(</span><span style="color: #98be65;">"/scratch/90days/uqsliu28/projects/sbayesRC/ldAndMa/sim/data/"</span><span style="color: #51afef;">)</span>
commandline &lt;- paste0<span style="color: #51afef;">(</span><span style="color: #98be65;">"</span><span style="color: #98be65;">mkdir</span><span style="color: #98be65;"> -p "</span>,outPath<span style="color: #51afef;">)</span>
<span style="color: #c678dd;">system</span><span style="color: #51afef;">(</span>commandline<span style="color: #51afef;">)</span>

rawFamFileSuffix &lt;- paste0<span style="color: #51afef;">(</span><span style="color: #98be65;">"ukbEURu_imp_v3_HM3_maf01"</span> <span style="color: #51afef;">)</span>
rawFamFile &lt;- paste0<span style="color: #51afef;">(</span>rawDataPath,rawFamFileSuffix,<span style="color: #98be65;">".fam"</span><span style="color: #51afef;">)</span>
fam &lt;- fread<span style="color: #51afef;">(</span>rawFamFile<span style="color: #51afef;">)</span>
<span style="color: #c678dd;">names</span><span style="color: #51afef;">(</span>fam<span style="color: #51afef;">)</span> &lt;- c<span style="color: #51afef;">(</span><span style="color: #98be65;">"FID"</span>,<span style="color: #98be65;">"IID"</span>,<span style="color: #98be65;">"FA"</span>,<span style="color: #98be65;">"MA"</span>,<span style="color: #98be65;">"SEX"</span>,<span style="color: #98be65;">"PHENO"</span><span style="color: #51afef;">)</span>

sams &lt;- c<span style="color: #51afef;">(</span>300000,dim<span style="color: #c678dd;">(</span>fam<span style="color: #c678dd;">)[</span><span style="color: #da8548; font-weight: bold;">1</span><span style="color: #c678dd;">]</span> - <span style="color: #da8548; font-weight: bold;">300000</span><span style="color: #51afef;">)</span>
tags &lt;- c<span style="color: #51afef;">(</span><span style="color: #98be65;">"train"</span>,<span style="color: #98be65;">"valid"</span><span style="color: #51afef;">)</span>
samsLeft &lt;- fam<span style="color: #51afef;">[</span>,c<span style="color: #c678dd;">(</span><span style="color: #98be65;">"FID"</span>,<span style="color: #98be65;">"IID"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">]</span>
<span style="color: #51afef;">for</span><span style="color: #51afef;">(</span>i<span style="color: #51afef;"> in</span> 1:length<span style="color: #c678dd;">(</span>sams<span style="color: #c678dd;">)</span><span style="color: #51afef;">){</span>
    tmp &lt;- samsLeft<span style="color: #c678dd;">[</span>sample<span style="color: #98be65;">(</span>.N,sams<span style="color: #a9a1e1;">[</span>i<span style="color: #a9a1e1;">]</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">]</span>
    <span style="color: #5B6268;">## </span><span style="color: #5B6268;">remove inds sampled</span>
    samsLeft &lt;- samsLeft<span style="color: #c678dd;">[</span><span style="color: #51afef; font-weight: bold;">!</span>samsLeft$<span style="color: #dcaeea;">FID</span> %in% tmp$<span style="color: #dcaeea;">FID</span>,<span style="color: #c678dd;">]</span>
    <span style="color: #5B6268;">## </span><span style="color: #5B6268;">training dataset</span>
    tmpFileName &lt;- paste0<span style="color: #c678dd;">(</span>tags<span style="color: #98be65;">[</span>i<span style="color: #98be65;">]</span>,<span style="color: #98be65;">"-chr1-22-shuf-"</span>,sams<span style="color: #98be65;">[</span>i<span style="color: #98be65;">]</span>,
                          <span style="color: #98be65;">"-sams-ukbEURu_imp_v3_HM3_maf01-"</span>,Sys.Date<span style="color: #98be65;">()</span>,<span style="color: #98be65;">".samlist"</span><span style="color: #c678dd;">)</span>
    tmpFilePath &lt;- paste0<span style="color: #c678dd;">(</span>outPath,tmpFileName<span style="color: #c678dd;">)</span>
    fwrite<span style="color: #c678dd;">(</span>data.frame<span style="color: #98be65;">(</span>tmp<span style="color: #98be65;">)</span>,<span style="color: #dcaeea;">file</span>=tmpFilePath,col.names = FALSE, <span style="color: #dcaeea;">sep</span> = <span style="color: #98be65;">"\t"</span><span style="color: #c678dd;">)</span>
<span style="color: #51afef;">}</span>

</pre>
</div>
</div>
</div>
