sim/single-trait-simulation.org
*** Selecting a series of training datasets
#+begin_src bash
####################################################################
## ExtractASeriesOfTrain.sh
## Extraxt SNPs from 22 chromosome UKB unrelated European
## Author: Shouye Liu <syliu.xue@foxmail.com>
## Version: 1.0
## Date:<2022-03-10 Thu>
####################################################################
## homePath="/home/yangjianLab/liushouye/"
homePath="/home/uqsliu28/"
MainPath="${homePath}/projects/annotation/"
plink2="${homePath}/softwares/plink/plink2"

rawDatPath="${MainPath}/dataRaw/ukbGeno/"
outPath="/scratch/90days/uqsliu28/projects/sbayesRC/ldAndMa/sim/data/"
## file
## in westlake
##plinkbfile="${rawDatPath}/chr1-eur-349662-sam-unrel-maf01-geno01-hwe-1e-6-2021-09-19"
## in UQ
plinkbfile="${rawDatPath}/ukbEURu_imp_v3_HM3_maf01"
selectSampleIdSuffix=$1

${plink2} --bfile ${plinkbfile} \
--keep ${outPath}/${selectSampleIdSuffix}.samlist \
--make-bed    \
--threads  100 \
--out ${outPath}/${selectSampleIdSuffix}
################################################################
## Write multiple lines to a given script from the command line
## EOF
#################################5###############################
######################### Script ends ##########################
################################################################
## Step 2. Set cluster parameters and submit the script into cluster
## Step 1. Basic cluster setting
## homePath="/home/yangjianLab/liushouye/"
if false; then
homePath="/home/uqsliu28/"
qsubshcom="${homePath}/softwares/qsubshcom/qsubshcom"
## scriptPath="${homePath}/projects/annotation/sim/prediction/eqtlComparison/scripts"
scriptPath="/scratch/90days/uqsliu28/projects/sbayesRC/ldAndMa/sim/data/"

declare -a samfiles=("train-chr1-22-shuf-300000-sams-ukbEURu_imp_v3_HM3_maf01-2023-02-21"
"valid-chr1-22-shuf-48501-sams-ukbEURu_imp_v3_HM3_maf01-2023-02-21"
)

## declare -a samfiles=( "vary-train-chr1-shuf-5000-sams-eur-unrel-maf01-geno01-hwe-1e-6-2021-09-25")
#################################################################
#################################################################
## declare -a samNums=( "10000" )
scriptName="ExtractASeriesOfTrain.sh"
chmod 751 ${scriptPath}/${scriptName}
for samfile in "${samfiles[@]}"
do
tmp_cmd="${scriptPath}/${scriptName} ${samfile}"
qsubName="${samfile}-${scriptName}"
## $qsubshcom "$tmp_cmd" 1 60G  ${qsubName}  100:00:00 "-queue=intel-fat,amd-ep2"
$qsubshcom "$tmp_cmd" 1 100G  ${qsubName}  100:00:00 "-queue=normal"
done

fi

##################################################################
##################################################################
#+end_src
