sim/single-trait-simulation.html
<div id="outline-container-orgaaf44e6" class="outline-4">
<h4 id="orgaaf44e6"><span class="section-number-4">2.1.2.</span> Selecting a series of training datasets</h4>
<div class="outline-text-4" id="text-2-1-2">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #5B6268;">####################################################################</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">ExtractASeriesOfTrain.sh</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">Extraxt SNPs from 22 chromosome UKB unrelated European</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">Author: Shouye Liu <a href="mailto:syliu.xue%40foxmail.com">&lt;syliu.xue@foxmail.com&gt;</a></span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">Version: 1.0</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">Date:&lt;2022-03-10 Thu&gt;</span>
<span style="color: #5B6268;">####################################################################</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">homePath="/home/yangjianLab/liushouye/"</span>
<span style="color: #dcaeea;">homePath</span>=<span style="color: #98be65;">"/home/uqsliu28/"</span>
<span style="color: #dcaeea;">MainPath</span>=<span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">{homePath}</span><span style="color: #98be65;">/projects/annotation/"</span>
<span style="color: #dcaeea;">plink2</span>=<span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">{homePath}</span><span style="color: #98be65;">/softwares/plink/plink2"</span>

<span style="color: #dcaeea;">rawDatPath</span>=<span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">{MainPath}</span><span style="color: #98be65;">/dataRaw/ukbGeno/"</span>
<span style="color: #dcaeea;">outPath</span>=<span style="color: #98be65;">"/scratch/90days/uqsliu28/projects/sbayesRC/ldAndMa/sim/data/"</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">file</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">in westlake</span>
<span style="color: #5B6268;">##</span><span style="color: #5B6268;">plinkbfile="${rawDatPath}/chr1-eur-349662-sam-unrel-maf01-geno01-hwe-1e-6-2021-09-19"</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">in UQ</span>
<span style="color: #dcaeea;">plinkbfile</span>=<span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">{rawDatPath}</span><span style="color: #98be65;">/ukbEURu_imp_v3_HM3_maf01"</span>
<span style="color: #dcaeea;">selectSampleIdSuffix</span>=$<span style="color: #da8548; font-weight: bold;">1</span>

$<span style="color: #51afef;">{</span><span style="color: #dcaeea;">plink2</span><span style="color: #51afef;">}</span> --bfile $<span style="color: #51afef;">{</span><span style="color: #dcaeea;">plinkbfile</span><span style="color: #51afef;">}</span> <span style="color: #98be65;">\</span>
--keep $<span style="color: #51afef;">{</span><span style="color: #dcaeea;">outPath</span><span style="color: #51afef;">}</span>/$<span style="color: #51afef;">{</span><span style="color: #dcaeea;">selectSampleIdSuffix</span><span style="color: #51afef;">}</span>.samlist <span style="color: #98be65;">\</span>
--make-bed    <span style="color: #98be65;">\</span>
--threads  <span style="color: #da8548; font-weight: bold;">100</span> <span style="color: #98be65;">\</span>
--out $<span style="color: #51afef;">{</span><span style="color: #dcaeea;">outPath</span><span style="color: #51afef;">}</span>/$<span style="color: #51afef;">{</span><span style="color: #dcaeea;">selectSampleIdSuffix</span><span style="color: #51afef;">}</span>
<span style="color: #5B6268;">################################################################</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">Write multiple lines to a given script from the command line</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">EOF</span>
<span style="color: #5B6268;">#################################</span><span style="color: #5B6268;">5###############################</span>
<span style="color: #5B6268;">######################### </span><span style="color: #5B6268;">Script ends ##########################</span>
<span style="color: #5B6268;">################################################################</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">Step 2. Set cluster parameters and submit the script into cluster</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">Step 1. Basic cluster setting</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">homePath="/home/yangjianLab/liushouye/"</span>
<span style="color: #51afef;">if </span><span style="color: #c678dd;">false</span>; <span style="color: #51afef;">then</span>
<span style="color: #dcaeea;">homePath</span>=<span style="color: #98be65;">"/home/uqsliu28/"</span>
<span style="color: #dcaeea;">qsubshcom</span>=<span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">{homePath}</span><span style="color: #98be65;">/softwares/qsubshcom/qsubshcom"</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">scriptPath="${homePath}/projects/annotation/sim/prediction/eqtlComparison/scripts"</span>
<span style="color: #dcaeea;">scriptPath</span>=<span style="color: #98be65;">"/scratch/90days/uqsliu28/projects/sbayesRC/ldAndMa/sim/data/"</span>

<span style="color: #c678dd;">declare</span> -a <span style="color: #dcaeea;">samfiles</span>=<span style="color: #51afef;">(</span><span style="color: #98be65;">"train-chr1-22-shuf-300000-sams-ukbEURu_imp_v3_HM3_maf01-2023-02-21"</span>
<span style="color: #98be65;">"valid-chr1-22-shuf-48501-sams-ukbEURu_imp_v3_HM3_maf01-2023-02-21"</span>
<span style="color: #51afef;">)</span>

<span style="color: #5B6268;">## </span><span style="color: #5B6268;">declare -a samfiles=( "vary-train-chr1-shuf-5000-sams-eur-unrel-maf01-geno01-hwe-1e-6-2021-09-25")</span>
<span style="color: #5B6268;">#################################################################</span>
<span style="color: #5B6268;">#################################################################</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">declare -a samNums=( "10000" )</span>
<span style="color: #dcaeea;">scriptName</span>=<span style="color: #98be65;">"ExtractASeriesOfTrain.sh"</span>
<span style="color: #ECBE7B;">chmod</span> <span style="color: #da8548; font-weight: bold;">751</span> $<span style="color: #51afef;">{</span><span style="color: #dcaeea;">scriptPath</span><span style="color: #51afef;">}</span>/$<span style="color: #51afef;">{</span><span style="color: #dcaeea;">scriptName</span><span style="color: #51afef;">}</span>
<span style="color: #51afef;">for</span> samfile<span style="color: #51afef;"> in</span> <span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">{samfiles[@]}</span><span style="color: #98be65;">"</span>
<span style="color: #51afef;">do</span>
<span style="color: #dcaeea;">tmp_cmd</span>=<span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">{scriptPath}</span><span style="color: #98be65;">/</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">{scriptName}</span><span style="color: #98be65;"> </span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">{samfile}</span><span style="color: #98be65;">"</span>
<span style="color: #dcaeea;">qsubName</span>=<span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">{samfile}</span><span style="color: #98be65;">-</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">{scriptName}</span><span style="color: #98be65;">"</span>
<span style="color: #5B6268;">## </span><span style="color: #5B6268;">$qsubshcom "$tmp_cmd" 1 60G  ${qsubName}  100:00:00 "-queue=intel-fat,amd-ep2"</span>
$<span style="color: #dcaeea;">qsubshcom</span> <span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">tmp_cmd</span><span style="color: #98be65;">"</span> <span style="color: #da8548; font-weight: bold;">1</span> 100G  $<span style="color: #51afef;">{</span><span style="color: #dcaeea;">qsubName</span><span style="color: #51afef;">}</span>  100:00:00 <span style="color: #98be65;">"-queue=normal"</span>
<span style="color: #51afef;">done</span>

<span style="color: #51afef;">fi</span>

<span style="color: #5B6268;">##################################################################</span>
<span style="color: #5B6268;">##################################################################</span>
</pre>
</div>
</div>
</div>
</div>
