sim/single-trait-simulation.org
** Generating simulation
#+begin_src R
####################################################################
#### Author: Shouye Liu
#### Email: syliu.xue@foxmail.com
####################################################################
options(scipen=999)
library(data.table)
set.seed(1234)
MainPath <- "/home/uqsliu28/projects/annotation/"
gcta64 = "/home/uqsliu28/softwares/gcta/gcta64"
plink19 = "/home/uqsliu28/softwares/plink/plink19"

rawDataPath <- paste0( "/scratch/90days/uqsliu28/projects/sbayesRC/ldAndMa/sim/data/")
outPath = "/home/uqsliu28/90days/projects/sbayesRC/ldAndMa/sim/gcta/"

rawBimFileSuffix <- paste0("train-chr1-22-shuf-300000-sams-ukbEURu_imp_v3_HM3_maf01-2023-02-21" )
rawBimFile <- paste0(rawDataPath,rawBimFileSuffix,".bim")
bim <- fread(rawBimFile)
names(bim) <- c("CHR","SNP","POS","CM","A1","A2 ")
### Step 1. generate causal snplists
repNum = 1
h2snp = 0.5
sams <- c(10) * 1000
sigmaSq = h2snp / sams
samsLeft <- bim
tmp <- samsLeft[sample(.N,sams)]
tmp$beta = rnorm(sams,0,sqrt(sigmaSq) )

causalSnplistFile = paste0(outPath,rawBimFileSuffix,"-causal.snplist")
fwrite(data.frame(tmp[,c("SNP","beta")]),file=causalSnplistFile,col.names = FALSE, sep = "\t")
### Step 2. do simulation
gctaMlm <- paste0(gcta64," --bfile ",rawDataPath,rawBimFileSuffix,
                  " --simu-qt ",
                  " --simu-causal-loci ", causalSnplistFile,
                  " --simu-hsq ",h2snp,
                  " --simu-rep ", repNum,
                  " --thread-num 100",
                  " --out ", outPath, rawBimFileSuffix, ".sim"
                  )
system(gctaMlm)

## Step 3. extract summary data
plinkGWAS <- paste0(plink19," --bfile ",rawDataPath,rawBimFileSuffix,
                    " --pheno ", outPath, rawBimFileSuffix, ".sim.phen",
                    " --linear ",
                    " --out ", outPath, rawBimFileSuffix, ".assoc"
                    )

## run gwas function
system(plinkGWAS)

#+end_src
