sim/single-trait-simulation.html
<div id="outline-container-orge104089" class="outline-3">
<h3 id="orge104089"><span class="section-number-3">2.2.</span> Generating simulation</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #5B6268;">####################################################################</span>
<span style="color: #5B6268;">#### </span><span style="color: #5B6268;">Author: Shouye Liu</span>
<span style="color: #5B6268;">#### </span><span style="color: #5B6268;">Email: syliu.xue@foxmail.com</span>
<span style="color: #5B6268;">####################################################################</span>
<span style="color: #a9a1e1;">options</span>(scipen=<span style="color: #da8548; font-weight: bold;">999</span>)
<span style="color: #a9a1e1;">library</span>(data.table)
set.seed(<span style="color: #da8548; font-weight: bold;">1234</span>)
MainPath <span style="color: #a9a1e1;">&lt;-</span> <span style="color: #98be65;">"/home/uqsliu28/projects/annotation/"</span>
gcta64 = <span style="color: #98be65;">"/home/uqsliu28/softwares/gcta/gcta64"</span>
plink19 = <span style="color: #98be65;">"/home/uqsliu28/softwares/plink/plink19"</span>

rawDataPath <span style="color: #a9a1e1;">&lt;-</span> paste0( <span style="color: #98be65;">"/scratch/90days/uqsliu28/projects/sbayesRC/ldAndMa/sim/data/"</span>)
outPath = <span style="color: #98be65;">"/home/uqsliu28/90days/projects/sbayesRC/ldAndMa/sim/gcta/"</span>

rawBimFileSuffix <span style="color: #a9a1e1;">&lt;-</span> paste0(<span style="color: #98be65;">"train-chr1-22-shuf-300000-sams-ukbEURu_imp_v3_HM3_maf01-2023-02-21"</span> )
rawBimFile <span style="color: #a9a1e1;">&lt;-</span> paste0(rawDataPath,rawBimFileSuffix,<span style="color: #98be65;">".bim"</span>)
bim <span style="color: #a9a1e1;">&lt;-</span> fread(rawBimFile)
names(bim) <span style="color: #a9a1e1;">&lt;-</span> c(<span style="color: #98be65;">"CHR"</span>,<span style="color: #98be65;">"SNP"</span>,<span style="color: #98be65;">"POS"</span>,<span style="color: #98be65;">"CM"</span>,<span style="color: #98be65;">"A1"</span>,<span style="color: #98be65;">"A2 "</span>)
<span style="color: #5B6268;">### </span><span style="color: #5B6268;">Step 1. generate causal snplists</span>
repNum = <span style="color: #da8548; font-weight: bold;">1</span>
h2snp = <span style="color: #da8548; font-weight: bold;">0.5</span>
sams <span style="color: #a9a1e1;">&lt;-</span> c(<span style="color: #da8548; font-weight: bold;">10</span>) * <span style="color: #da8548; font-weight: bold;">1000</span>
sigmaSq = h2snp / sams
samsLeft <span style="color: #a9a1e1;">&lt;-</span> bim
tmp <span style="color: #a9a1e1;">&lt;-</span> samsLeft[sample(.N,sams)]
tmp$beta = rnorm(sams,<span style="color: #da8548; font-weight: bold;">0</span>,sqrt(sigmaSq) )

causalSnplistFile = paste0(outPath,rawBimFileSuffix,<span style="color: #98be65;">"-causal.snplist"</span>)
fwrite(data.frame(tmp[,c(<span style="color: #98be65;">"SNP"</span>,<span style="color: #98be65;">"beta"</span>)]),file=causalSnplistFile,col.names = <span style="color: #ECBE7B;">FALSE</span>, sep = <span style="color: #98be65;">"\t"</span>)
<span style="color: #5B6268;">### </span><span style="color: #5B6268;">Step 2. do simulation</span>
gctaMlm <span style="color: #a9a1e1;">&lt;-</span> paste0(gcta64,<span style="color: #98be65;">" --bfile "</span>,rawDataPath,rawBimFileSuffix,
                  <span style="color: #98be65;">" --simu-qt "</span>,
                  <span style="color: #98be65;">" --simu-causal-loci "</span>, causalSnplistFile,
                  <span style="color: #98be65;">" --simu-hsq "</span>,h2snp,
                  <span style="color: #98be65;">" --simu-rep "</span>, repNum,
                  <span style="color: #98be65;">" --thread-num 100"</span>,
                  <span style="color: #98be65;">" --out "</span>, outPath, rawBimFileSuffix, <span style="color: #98be65;">".sim"</span>
                  )
system(gctaMlm)

<span style="color: #5B6268;">## </span><span style="color: #5B6268;">Step 3. extract summary data</span>
plinkGWAS <span style="color: #a9a1e1;">&lt;-</span> paste0(plink19,<span style="color: #98be65;">" --bfile "</span>,rawDataPath,rawBimFileSuffix,
                    <span style="color: #98be65;">" --pheno "</span>, outPath, rawBimFileSuffix, <span style="color: #98be65;">".sim.phen"</span>,
                    <span style="color: #98be65;">" --linear "</span>,
                    <span style="color: #98be65;">" --out "</span>, outPath, rawBimFileSuffix, <span style="color: #98be65;">".assoc"</span>
                    )

<span style="color: #5B6268;">## </span><span style="color: #5B6268;">run gwas function</span>
system(plinkGWAS)

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-03-01</p>
<p class="author">Author: Liu, Shouye</p>
<p class="date">Created: 2023-03-01 Wed 15:46</p>
</div>
</body>
</html>
